controller-works/circuitpython/ports/raspberrypi/boards/controllerworks_mini42_rp2040/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Controller Works mini42"
#define MICROPY_HW_MCU_NAME "rp2040"

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO25)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO24)

#define DEFAULT_UART_BUS_RX (&pin_GPIO1)
#define DEFAULT_UART_BUS_TX (&pin_GPIO0)
